; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_12 ?v1 ?v8)
             (pred_1 ?v6 ?v2)
             (pred_11 ?v1 ?v2)
             (pred_2 ?v4 ?v1 )
	     (pred_10 ?v1)
             (pred_8 ?v13)
             (pred_4 ?v6)
             (pred_6 ?v2)
             (pred_9 ?v1)
             (pred_7 ?v6)
             (pred_3 ?v1)
             (pred_5 ))



(:action op_5
:parameters (?v5 ?v7 ?v9 ?v12)
:precondition (and (pred_8 ?v5) (pred_8 ?v7) (pred_4 ?v9) (pred_6 ?v12)
          (pred_12 ?v5 ?v7) (pred_1 ?v9 ?v12)
                   (pred_11 ?v7 ?v12) (pred_10 ?v5) 
                   (pred_9 ?v7) (pred_7 ?v9))
:effect (and  (pred_3 ?v7) (not (pred_9 ?v7))))


(:action op_3
:parameters (?v5 ?v11)
:precondition (and (pred_8 ?v5) (pred_8 ?v11)
               (pred_10 ?v5) (pred_12 ?v5 ?v11) (pred_3 ?v11))
:effect (and (pred_10 ?v11) (not (pred_10 ?v5))))

(:action op_4
:parameters (?v5 ?v9)
:precondition (and (pred_8 ?v5) (pred_4 ?v9) 
                  (pred_10 ?v5) (pred_2 ?v9 ?v5) (pred_5 ))
:effect (and (pred_7 ?v9)
   (not (pred_2 ?v9 ?v5)) (not (pred_5 ))))


(:action op_2
:parameters (?v5 ?v10 ?v3)
:precondition (and (pred_8 ?v5) (pred_4 ?v10) (pred_4 ?v3)
                  (pred_10 ?v5) (pred_7 ?v3) (pred_2 ?v10 ?v5))
:effect (and (pred_7 ?v10) (pred_2 ?v3 ?v5)
        (not (pred_7 ?v3)) (not (pred_2 ?v10 ?v5))))

(:action op_1
:parameters (?v5 ?v9)
:precondition (and (pred_8 ?v5) (pred_4 ?v9) 
                  (pred_10 ?v5) (pred_7 ?v9))
:effect (and (pred_5 ) (pred_2 ?v9 ?v5) (not (pred_7 ?v9)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_12 obj_01 obj_05 obj_10 obj_13 obj_02 obj_11 obj_03 obj_04
    obj_09 obj_08
    obj_06 obj_07
    )

    (:init
       (pred_5)

       (pred_8 obj_12)
       (pred_8 obj_01)
       (pred_8 obj_05)
       (pred_8 obj_10)
       (pred_8 obj_13)
       (pred_8 obj_02)
       (pred_8 obj_11)
       (pred_8 obj_03)
       (pred_8 obj_04)
       (pred_6 obj_09)
       (pred_6 obj_08)
       (pred_4 obj_06)
       (pred_4 obj_07)

       (pred_12 obj_12 obj_10)
       (pred_12 obj_12 obj_01)
       (pred_12 obj_01 obj_13)
       (pred_12 obj_01 obj_05)
       (pred_12 obj_01 obj_12)
       (pred_12 obj_05 obj_02)
       (pred_12 obj_05 obj_01)
       (pred_12 obj_10 obj_11)
       (pred_12 obj_10 obj_13)
       (pred_12 obj_10 obj_12)
       (pred_12 obj_13 obj_03)
       (pred_12 obj_13 obj_02)
       (pred_12 obj_13 obj_01)
       (pred_12 obj_13 obj_10)
       (pred_12 obj_02 obj_04)
       (pred_12 obj_02 obj_05)
       (pred_12 obj_02 obj_13)
       (pred_12 obj_11 obj_03)
       (pred_12 obj_11 obj_10)
       (pred_12 obj_03 obj_04)
       (pred_12 obj_03 obj_13)
       (pred_12 obj_03 obj_11)
       (pred_12 obj_04 obj_02)
       (pred_12 obj_04 obj_03)
       (pred_9 obj_12)
       (pred_9 obj_11)
       (pred_11  obj_12 obj_09)
       (pred_11  obj_11 obj_08)
       (pred_3 obj_01)
       (pred_3 obj_05)
       (pred_3 obj_10)
       (pred_3 obj_13)
       (pred_3 obj_02)
       (pred_3 obj_03)
       (pred_3 obj_04)

       (pred_1  obj_06 obj_09)
       (pred_1  obj_07 obj_08)
       (pred_2 obj_06 obj_03)
       (pred_2 obj_07 obj_01)
       (pred_10 obj_02)
    )

    (:goal (and
       (pred_2 obj_06 obj_12)
       (pred_2 obj_07 obj_05)
    ))
(:constraints
  (always (not (pred_10 obj_13)))
)
)

; plan
1. (op_3 obj_02 obj_05)
   deleted: (pred_10 obj_02)
   added: (pred_10 obj_05)
   goals met: 0 of 2
2. (op_3 obj_05 obj_01)
   deleted: (pred_10 obj_05)
   added: (pred_10 obj_01)
   goals met: 0 of 2
3. (op_4 obj_01 obj_07)
   deleted: (pred_2 obj_07 obj_01) (pred_5)
   added: (pred_7 obj_07)
   goals met: 0 of 2
4. (op_3 obj_01 obj_05)
   deleted: (pred_10 obj_01)
   added: (pred_10 obj_05)
   goals met: 0 of 2
5. (op_1 obj_05 obj_07)
   deleted: (pred_7 obj_07)
   added: (pred_5) (pred_2 obj_07 obj_05)
   goals met: 1 of 2
6. (op_3 obj_05 obj_02)
   deleted: (pred_10 obj_05)
   added: (pred_10 obj_02)
   goals met: 1 of 2
7. (op_3 obj_02 obj_04)
   deleted: (pred_10 obj_02)
   added: (pred_10 obj_04)
   goals met: 1 of 2
8. (op_3 obj_04 obj_03)
   deleted: (pred_10 obj_04)
   added: (pred_10 obj_03)
   goals met: 1 of 2
9. (op_4 obj_03 obj_06)
   deleted: (pred_2 obj_06 obj_03) (pred_5)
   added: (pred_7 obj_06)
   goals met: 1 of 2
10. (op_3 obj_03 obj_04)
   deleted: (pred_10 obj_03)
   added: (pred_10 obj_04)
   goals met: 1 of 2
11. (op_3 obj_04 obj_02)
   deleted: (pred_10 obj_04)
   added: (pred_10 obj_02)
   goals met: 1 of 2
12. (op_3 obj_02 obj_05)
   deleted: (pred_10 obj_02)
   added: (pred_10 obj_05)
   goals met: 1 of 2
13. (op_3 obj_05 obj_01)
   deleted: (pred_10 obj_05)
   added: (pred_10 obj_01)
   goals met: 1 of 2
14. (op_5 obj_01 obj_12 obj_06 obj_09)
   deleted: (pred_9 obj_12)
   added: (pred_3 obj_12)
   goals met: 1 of 2
15. (op_3 obj_01 obj_12)
   deleted: (pred_10 obj_01)
   added: (pred_10 obj_12)
   goals met: 1 of 2
16. (op_1 obj_12 obj_06)
   deleted: (pred_7 obj_06)
   added: (pred_5) (pred_2 obj_06 obj_12)
   goals met: 2 of 2
